[M_Orchid_Wingman MissionDefinition]
MissionName="Throw the rope"
MissionDescription="Hai wants to marry a woman named Natalie who has unfortunately lost her engagement ring, and if you find him and help Shadow marry Natalie, it becomes a semi-synchronized game of Pandora.."
TurnInDescription="Natalie looked at her shadow happily. So make sure you never share it in your marriage."
MissionSummary="Shadow helped give Natalia advice."
MissionGiver="thirty"
MissionTurnInLocation="shadow"
TeaserText="Help me.."

[M_Orchid_Wingman:FindRing MissionObjectiveDefinition]
ProgressMessage="Wear your wedding ring"

[M_Orchid_Wingman:FindRingSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_Wingman:Propose MissionObjectiveDefinition]
ProgressMessage="He asks Natalie to marry him"

[M_Orchid_Wingman:ProposeSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_Wingman:ReturnToShadyDealer MissionObjectiveDefinition]
ProgressMessage="Back in the shadows"

[M_Orchid_Wingman:ReturnToShadyDealerSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

